app/Controllers/Boletos.php

    public function index()
    {
        $data['link'] = $this->link;

        $data['titulo'] = [
            'modulo' => 'Boletos',
            'icone'  => 'fa fa-book-open'
        ];

        $data['caminhos'] = [
            ['titulo' => "Início", 'rota' => "/inicio", 'active' => false],
            ['titulo' => "Boletos", 'rota'   => "", 'active' => true]
        ];

        $data['controle_de_acesso'] = $this->controle_de_acesso_model
                                            ->where('id_empresa', $this->id_empresa)
                                            ->where('id_login', $this->id_login)
                                            ->first();

        $data['boletos'] = $this->boleto_model
                                        ->findAll();
---
SELECT *
FROM `controle_de_acesso`
WHERE `id_empresa` IS NULL
AND `id_login` = '1'
 LIMIT 1
SELECT *
FROM `boletos`