app/Controllers/Login.php

    public function autenticar()
    {
        $dados = $this->request->getvar();

        $login = $this->login_model
                    ->where('usuario', $dados['usuario'])
                    ->where('senha', $dados['senha'])
                    ->first();
---
SELECT *
FROM `login`
WHERE `usuario` = 'anunciosItu'
AND `senha` = '123'
 LIMIT 1


            elseif($login['tipo'] == 2) :

                $empresa = $this->empresa_model
                                ->where('id_empresa', $login['id_empresa'])
                                ->select('xFant, logomarca')
                                ->first();
---
SELECT `xFant`, `logomarca`
FROM `empresas`
WHERE `id_empresa` = '2'
 LIMIT 1

    public function verificaNomeDeUsuario()
    {
        $usuario = $this->request->getVar('usuario');

        $ret = $this->login_model
                    ->where('usuario', $usuario)
                    ->findAll();
---
SELECT *
FROM `login`
WHERE `usuario` = 'anunciosItu'